In [25]:
import pandas as pd
MyDict = {'A':10,'B':20,'C':30}
series = pd.Series(MyDict,index=['C','A','B'])
print("All series")
print(series)
print("series['B'] = ",end='')
print(series['B'])

All series
C    30
A    10
B    20
dtype: int64
series['B'] = 20

In [28]:
s=pd.Series([1,2,3,4,5],['a','b','c','d','e'])
print(s)
print("\n s['c'] = ",end='')
print(s['c'])
print("\n s[2] = ",end='')
print(s[2])


s1=pd.Series(["sd","sa"],[1,2])
print("\n Printing s1")
print(s1)

a    1
b    2
c    3
d    4
e    5
dtype: int64

 s['c'] = 3

 s[2] = 3

 Printing s1
1    sd
2    sa
dtype: object

In [22]:
import numpy as np
d={'Jalandhar':800000,'Amritsar':1000000,'Delhi':200000}
cities=pd.Series(d)
print("All cities")
print(cities)
print("\nAll cities greater than 800000")
print(cities[cities>800000])
print("\nAll cities less than 790000")
print(cities[cities>790000])
print("\nnp.square(cities)")
print(np.square(cities))
print("\ncities.isnull()")
print(cities.isnull())

All cities
Jalandhar     800000
Amritsar     1000000
Delhi         200000
dtype: int64

All cities greater than 800000
Amritsar    1000000
dtype: int64

All cities less than 790000
Jalandhar     800000
Amritsar     1000000
dtype: int64

np.square(cities)
Jalandhar     640000000000
Amritsar     1000000000000
Delhi          40000000000
dtype: int64

cities.isnull()
Jalandhar    False
Amritsar     False
Delhi        False
dtype: bool

In [36]:
data={
    'students':['deepika','abhishit','maan'],
    'maths':[90,89,91],
    'science':[88,89,90],
    'job':['barbie mug se coffee peena','ungli krna','doglapanti']
}
Student=pd.DataFrame(data)
print(Student)

   students  maths  science                         job
0   deepika     90       88  barbie mug se coffee peena
1  abhishit     89       89                  ungli krna
2      maan     91       90                  doglapanti

In [40]:
StudentDat=pd.DataFrame(data,columns=['students','job'])
print(StudentDat)
print("Abhist's job = ",Student['job'][1])

   students                         job
0   deepika  barbie mug se coffee peena
1  abhishit                  ungli krna
2      maan                  doglapanti
Abhist's job =  ungli krna

In [50]:
ulta=Student.T
print(ulta)
print("\nData Types\n",ulta.dtypes)
print("Dimensions = ",ulta.ndim)
print("Shape = ",ulta.shape)
print("Size = ",ulta.size)

                                   0           1           2
students                     deepika    abhishit        maan
maths                             90          89          91
science                           88          89          90
job       barbie mug se coffee peena  ungli krna  doglapanti

Data Types
 0    object
1    object
2    object
dtype: object
Dimensions =  2
Shape =  (4, 3)
Size =  12

In [2]:
import scipy as sp
import matplotlib as plt
import seaborn as sn

ModuleNotFoundError: No module named 'scipy'

In [5]:
import pandas as pd
df=pd.read_csv("D:\RoboAutomation\Salaries.csv")
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [7]:
df['salary'].mode()

0    92000
Name: salary, dtype: int64

In [9]:
df['salary'].count()

78

In [11]:
df['salary'].sum()

8425855

In [13]:
df_rank=df.groupby(['rank'])
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [19]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [20]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [21]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [24]:
df.std()

C:\Users\hp\AppData\Local\Temp\ipykernel_21412\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [25]:
first50 = df.head(50)
first50.mean()

C:\Users\hp\AppData\Local\Temp\ipykernel_21412\320520306.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  first50.mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [26]:
df.groupby(['rank'])(['salaery']).mean()

TypeError: 'DataFrameGroupBy' object is not callable

In [28]:
df_f = df[ df['sex'] == 'Female']
df_f.count()

rank          39
discipline    39
phd           39
service       39
sex           39
salary        39
dtype: int64

In [31]:
df.loc[10:20,['rank','sex','salary']]

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

In [33]:
df.iloc[10:20,[0,3,4,5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

In [34]:
df_sorted = df.sort_values( by='service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [38]:
df_sorted1 = df.sort_values( by=['service','salary'])
df_sorted1.tail()

    rank discipline  phd  service     sex  salary
40  Prof          A   39       36  Female  137000
27  Prof          A   45       43    Male  155865
36  Prof          B   45       45    Male  146856
0   Prof          B   56       49    Male  186960
9   Prof          A   51       51    Male   57800

In [40]:
df.dropna(how='all')

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [2]:
import pandas as pd
flightData = pd.read_csv("D:\RoboAutomation\Flight.csv")
flightData.isnull().count()

year         160754
month        160754
day          160754
dep_time     160754
dep_delay    160754
arr_time     160754
arr_delay    160754
carrier      160754
tailnum      160754
flight       160754
origin       160754
dest         160754
air_time     160754
distance     160754
hour         160754
minute       160754
dtype: int64

In [3]:
flightData[flightData.isnull().any(axis=1)].head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

In [4]:
#Find out the sum of NAN/empty rows in any column
flightData[flightData.isnull().any(axis=1)].sum()

C:\Users\hp\AppData\Local\Temp\ipykernel_11856\548364929.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  flightData[flightData.isnull().any(axis=1)].sum()

year                                                   5690751
month                                                    16206
day                                                      40840
dep_time                                              676006.0
dep_delay                                              13123.0
arr_time                                              555994.0
arr_delay                                                  0.0
carrier      UAAAAAUAAAAAUADLAAAAAAAAAAAAUAUAAAAAAAAAAAAAAA...
flight                                                 3419882
origin       EWRLGALGAEWRJFKLGAEWRLGALGALGALGALGALGALGAEWRE...
dest         SANDFWMIARSWLAXDFWORDMSYORDORDDFWDFWDFWSTLMIAD...
air_time                                                   0.0
distance                                               2937291
hour                                                    6605.0
minute                                                 15506.0
dtype: object

In [7]:
#Replace null value with "?"
flightData[flightData.isnull().any(axis=1)].fillna('?')

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,?,UA,N31412,1228,EWR,SAN,?,2425,18.0,7.0
403,2013,1,1,?,?,?,?,AA,N3EHAA,791,LGA,DFW,?,1389,?,?
404,2013,1,1,?,?,?,?,AA,N3EVAA,1925,LGA,MIA,?,1096,?,?
855,2013,1,2,2145.0,16.0,?,?,UA,N12221,1299,EWR,RSW,?,1068,21.0,45.0
858,2013,1,2,?,?,?,?,AA,?,133,JFK,LAX,?,2475,?,?
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
159681,2013,9,28,1214.0,-11.0,1801.0,?,AA,N488AA,300,EWR,DFW,?,1372,12.0,14.0
159854,2013,9,28,?,?,?,?,AA,N320AA,1,JFK,LAX,?,2475,?,?
159855,2013,9,28,?,?,?,?,US,?,581,EWR,CLT,?,529,?,?
160185,2013,9,29,1734.0,23.0,2159.0,?,UA,N463UA,327,EWR,PDX,?,2434,17.0,34.0
160286,2013,9,29,?,?,?,?,UA,?,331,LGA,ORD,?,733,?,?

In [17]:
#Replace dep_time ? with the mean

In [19]:
flightData['day'].mode()

0    18
Name: day, dtype: int64

In [33]:
import numpy as np
def load_def():
    return pd.DataFrame({'string_col':['1','2','3','4'],'float_col':[1.1,1.2,1.3,1.4],
                         'int_col':[1,2,3,4], 'mix_col':['a',1,2,3],'missing_col':[1.0,2,3,np.nan],
                         'money_col':['D1,0000.00','D2,4000.00','D2,400.00','D3,500.00'],
                         'bool_col':[True,False,True,True],'custom':['Y','Y','N','N']})
df_test = load_def()
df_test

,string_col,float_col,int_col,mix_col,missing_col,money_col,bool_col,custom
0,1,1.1,1,a,1.0,"D1,0000.00",True,Y
1,2,1.2,2,1,2.0,"D2,4000.00",False,Y
2,3,1.3,3,2,3.0,"D2,400.00",True,N
3,4,1.4,4,3,NaN,"D3,500.00",True,N

In [38]:
df_test.dtypes

string_col      object
float_col      float64
int_col          int64
mix_col         object
missing_col    float64
money_col       object
bool_col          bool
custom          object
dtype: object

In [41]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   string_col   4 non-null      object
 1   float_col    4 non-null      float64
 2   int_col      4 non-null      int64
 3   mix_col      4 non-null      object
 4   missing_col  3 non-null      float64
 5   money_col    4 non-null      object
 6   bool_col     4 non-null      bool
 7   custom       4 non-null      object
dtypes: bool(1), float64(2), int64(1), object(4)
memory usage: 356.0+ bytes

In [42]:
data = {
    'x': [45,37,42,35,39],
    'y': [38,31,26,28,33],
    'z': [10,15,17,21,12]
}
dataframe = pd.DataFrame(data, columns = ['x', 'y', 'z'])
print("Dataframe is : ")
print(dataframe)

matrix = dataframe.corr()
print("Correlation matrix is : ")
print(matrix)

Dataframe is :
    x   y   z
0  45  38  10
1  37  31  15
2  42  26  17
3  35  28  21
4  39  33  12
Correlation matrix is :
          x         y         z
x  1.000000  0.518457 -0.701886
y  0.518457  1.000000 -0.860941
z -0.701886 -0.860941  1.000000